Repository: julienmalard/Tinamit
Catalog: docs/source/_locale/*/LC_MESSAGES/desarrollo/des_mds.po
Languages: ur

source: Agregar programas MDS
ur: پروگرام شامل کریں. (ایم ڈی ایس)

source: Para poder conectar modelos de dinámicas de sistemas (DS) en Tinamït, el programa DS debe ser compatible con Tinamït. Este se asegura por escribir una envoltura que controla el programa DS. Lo bueno es que las envolturas para programas DS en Tinamït funcionan para todos los modelos escritos con el programa. Por ejemplo, la envoltura :class:`~tinamit.MDS.ModeloVensim` permite conectar cualquier modelo escrito en Vensim con Tinamït.
ur: ٹينامٹ میںمتحرک نظام کے نمونے کو منسلک کرنے کے لۓ، ڈی ایس پروگرام کا ٹينامٹ کے ساتھ مطابقت پذیر ہونا ضروری ہے۔ یہ ایک تحریری جلد لکھتا ہے جو ڈی ایس پروگرام کو کنٹرول کرتا ہے۔ اچھی بات یہ ہے کہ ٹينامٹ ميں متحرک نظام کے ليے لکھی گئی جلد باقی تمام نمونوں کے ليے کام کرتی ہے۔ مثال کے طور پر، جلد 'class:`~tinamit.MDS.ModeloVensim: وینسم میںلکھے ہوے کسی بھی ماڈل کو ٹينامٹ کے ساتھ منسلک کرنے کی اجازت دیتی ہے۔

source: Cómo crear una nueva envoltura
ur: نئی لپیٹ کیسے بنائیں۔

source: Si quieres hacer una nueva envoltura para otro tipo de modelo DS, tendrás que hacer una subclase de :class:`~tinamit.MDS.EnvolturaMDS` e implementar las funciones siguientes:
ur: اگر آپ کسی دوسرے قسم کے متحرک نظام کے نمونے کے لئے ایک نئی جلدبنانا چاہتے ہیں تو، آپ کو ایک ذیلی طبقہ 'class:`~tinamit.MDS.EnvolturaMDS: بنانا ہوگا اور مندرجہ ذیل افعال لاگو کرنا ہوں گے۔

source: :func:`~tinamit.MDS.EnvolturaMDS.obt_unidad_tiempo`: Devuelve la unidad de tiempo del modelo.
ur: نمونے کا وقت یونٹ واپس کرتا ہے۔ 'func:`~tinamit.MDS.EnvolturaMDS.obt_unidad_tiempo:

source: :func:`~tinamit.MDS.EnvolturaMDS.inic_vars`: Incializa el diccionario interno de variables disponibles.
ur: دستیاب متغیر کی اندرونی لغت کو شروع کریں. 'func:`~tinamit.MDS.EnvolturaMDS.inic_vars:

source: :func:`~tinamit.MDS.EnvolturaMDS.iniciar_modelo`: Inicializa la simulación.
ur: تخروپن کو شروع کریں. ':func:`~tinamit.MDS.EnvolturaMDS.iniciar_modelo:

source: :func:`~tinamit.MDS.EnvolturaMDS.cambiar_vals_modelo_interno`: Cambia los valores internos de los variables.
ur: متغیرات کی اندرونی اقدار کو تبدیل کریں۔ 'func:`~tinamit.MDS.EnvolturaMDS.cambiar_vals_modelo_interno:

source: :func:`~tinamit.MDS.EnvolturaMDS.incrementar`: Avanza el modelo.
ur: نمونہ پیش کریں. 'func:`~tinamit.MDS.EnvolturaMDS.incrementar:

source: :func:`~tinamit.MDS.EnvolturaMDS.leer_vals`: Lee los egresos del modelo.
ur: نمونے کے اعدادوشمار پڑھیں۔ 'func:`~tinamit.MDS.EnvolturaMDS.leer_vals:

source: :func:`~tinamit.MDS.EnvolturaMDS.cerrar_modelo`: Cierre el modelo al final de una simulación.
ur: تخروپن کے اختتام پر ماڈل بند کریں۔ 'func:`~tinamit.MDS.EnvolturaMDS.cerrar_modelo:

source: Ver :class:`~tinamit.MDS.ModeloVensim` para un ejemplo.
ur: مثال کے طور پر متغير 'class:`~tinamit.MDS.ModeloVensim:

source: Cómo conectar tu envoltura con Tinamït
ur: ٹينامٹ کے ساتھ اپنی جلد کو کیسے مربوط کریں۔

source: Para que Tinamït pueda automáticamente crear la envoltura apropiada cuando un usuario le pasa un archivo de modelo DS, tienes que decir a Tinamït cuál extensión tienen los archivos de modelo DS que se deben abrir con tu nueva envoltura. Tendrás que modificar la función :func:`~tinamit.MDS.generar_mds` para incluir la(s) extension(es) para tu nuevo programa DS. Por ejemplo, para agregar una envoltura para Stella (suponemos que las extensiones serán ``.stmx`` o ``.stm``), cambiamos el código así::
ur: لہذا جب صارف کسی متحرک نظام نمونےکی دستاويز کو چنتا ہے تو ٹينامٹ خود کار طریقے سے موزوں جلد بنا سکتا ہے۔ آپ کو ٹينامٹ کو بتانا پڑے گا کہ آپ نئے کتابچے کے ساتھ متحرک نظام نمونے کی دستاويز ات کو کیسے کھولنا چاہتے ہيں۔ آپ کو نئے ڈی ایس پروگرام کی توسیع شامل کرنے کے لئے فعل 'func:`~tinamit.MDS.generar_mds: میں ترمیم کرنا پڑے گی۔ مثال کے طور پر، سٹیلا کی جلد شامل کرنے کے لئے (ہم سمجھتے ہیں کہ توسیع ہو گی``.stmx`` سے ``.stm``)، ہم کوڈ کو اس طرح تبدیل کريں گے۔

source: Leer egresos
ur: اعدادوشمار پڑھیں۔

source: Si quieres poder generar mapas, etc. con el egreso de tu modelo DS, tendrás que decir a Tinamït cómo leer el archivo de egresos de tu modelo DS. Al momento puede leer archivos ``.vdf`` de Vensim y ``.csv``. Si tu modelo DS genera otro formato raro, puedes modificar el código de :func:`~tinamit.MDS.leer_egr_mds` para que Tinamït lo pueda leer también.
ur: اگر آپ نقشے، وغیرہ بنانا چاہتے ہیں تو آپ کو متحرک نظام کے نمونے سے باہر نکلنے کے بعد، آپ کو اپنے متحرک نظام نمونے کےنتيجے سےٹينامٹ کو آگاہ کرنا پڑے گا. اس وقت آپ وینسیم ``.vdf`` اور``.csv``دستاويزات کو پڑھ سکتے ہیں۔ اگر آپ کا متحرک نظام کا نمونہ کسی اور شکل کے دستاويز کی تخلیق کرتا ہے تو، آپ کو فعل 'func:`~tinamit.MDS.leer_egr_mds: ميں ترمیم کرنا پڑھےگی تاکہ ٹنامیٹ اسے بھی پڑھ سکے۔

source: Cambios climáticos
ur: موسمیاتی تبدیلیاں۔

source: Al contrario de envolturas de modelos biofísicos, modelos DS no necesitan cualquier modificación para poder conectar con variables climáticos. El usuario simplemente debe llamar la función :func:`~tinamit.Modelo.Modelo.conectar_var_clima` con el nombre del variable climático en su modelo DS y el nombre estándar del variable climático correspondiente en Tinamït.
ur: حياتياتی نمونوں کی جلدوں کے برعکس، متحرک نظام کے نمونوں کو موسمی متغیرات سے منسلک کرنے کے قابل بنانے کے ليے کسی بھی ترمیم کی ضرورت نہیں ہے۔ صارف کو صرف فعل 'func:`~tinamit.Modelo.Modelo.conectar_var_clima: کو متحرک نظام کے نمونے میں موسمیاتی متغیر کے نام اورٹينامٹ میں اس آب و ہوا کے متغیر کےمعیاری نام کے ساتھ کال کرنا چاہئے۔
