Repository: julienmalard/Tinamit
Catalog: docs/source/_local/*/LC_MESSAGES/tutorial/clima.po
Languages: hi

source: Clima
hi: जलवायु

source: Tinamït puede incorporar datos de clima de manera automática, incluso con escenarios de cambios climáticos.
hi: तीनामित स्वचालित रूप से जलवायु के अंकड़ों जोड़ा सकता है, और यह, जलवायु परिवर्तन के परिदृश्य के साथ भी।

source: Tinamït emplea ``تقدیر`` (``taqdir``) para obtener datos de cambios climáticos. Si vas a hacer muchas simulaciones con predicciones futuras, se recomienda que leas su `documentación <https://taqdir.readthedocs.io/es/latest>`_.
hi: जलवायु परिवर्तन के आंकड़ों पाने के लिये तीनामित ``تقدیر`` (``तकदीर``) का प्रयोग करता है। अगर आप जलवायु भविष्यवाणी के साथ बहुत अनुकार करने वाली हैं, फिर उसके `प्रलेखण <https://taqdir.readthedocs.io/hi/latest>`_ पढ़ने आच्छी योजना हो सकती है।

source: Especificar variables
hi: परिवर्तनशील के निर्दिष्ट

source: Si tienes un variable climático en un modelo DS, puedes especificarlo con la función :func:`~tinamit.Modelo.conectar_var_clima`.
hi: अगर आपका प्रणाली गतिशील का प्रतिरूप में जलवायु का परिवर्तनशील है, तो :func:`~tinamit.Modelo.conectar_var_clima` नाम का फलन के साथ उसका निर्दिष्ट कर सकते हैं।

source: from tinamit.envolt.mds import gen_mds mod = gen_mds('Mi modelo.xmile') mod.conectar_var_clima(var='Lluvia', var_clima='بارش', combin='total', conv=0.001) mod.conectar_var_clima(var='Temperatura', var_clima='درجہ_حرارت_اوسط', combin='prom', conv=1)
hi: from tinamit.envolt.mds import gen_mds as प्रण_प्रजनन प्रतिरूप = प्रण_प्रजनन('मेरा प्रतिरूप.xmile') प्रतिरूप.conectar_var_clima(var='बारिश', var_clima='بارش', combin='total', conv=0.001) प्रतिरूप.conectar_var_clima(var='तापमान', var_clima='درجہ_حرارت_اوسط', combin='prom', conv=1)

source: El parámetro ``combin`` especifica cómo se deben combinar los datos climáticos de varios días si el modelo se simula con un paso de más de un día. Si es ``prom``, se tomará el promedio; si es ``total``, se tomará el total de los días incluidos.
hi: ``combin`` नाम का विकल्प इसको निर्दिष्ट करता है कि विभिन्न दिनों के जलवायु आंकड़ों को कैसा एक साथ इकट्ठे कर देना है अगर प्रतिरूप का समय का कदम १ दिन से बड़ा है। अगर ``prom`` है, तो औसत की जाएगी, और अगर ``total`` है, तो सारे शामिल दिनों के मूल्य जुड़े जाएंगे।

source: El parámetro ``var_clima`` **debe** ser un nombre de variable reconocido por taqdir (ver su `documentación <https://taqdir.readthedocs.io/ur/latest/malumat>`_). Igualmente, si la unidad del variable en tu modelo no corresponde a la unidad del variable en taqdir, tendrás que especificar el factor de conversión en ``conv``.
hi: ``var_clima`` नाम का विकल्प तकदीर को ज्ञात परिवर्तनशील का नाम **होने पड़ता है** (उसका `प्रलेखन <https://taqdir.readthedocs.io/ur/latest/malumat>`_ देखना)। इसके अलावा, अगर आपका प्रतिरूप का परिवर्तनशील का एकता तकदीर। का परिवर्तनशील का एकता से अलग है, तो ``conv`` नाम। का रूपांतरण का कारक का निर्दिष्ट करने पड़ेगा।

source: Para modelos BF, la conexión ya debería haberse efectuada en la envoltura específica al modelo, así que no deberías tener que hacer nada.
hi: वतावरण के प्रतिरूप के जलवायु परिवर्तनशील के निर्दिष्ट उसी प्रतिरूप के लिफाफा में पहले से ही किया गया होने चाहिये। तो आपको इसके बारे में कोई चिंता करने की आवश्यकता नहीं है।

source: Correr
hi: चलाना

source: Después crearemos un objeto :class:`~tinamit.mod.clima.Clima` para especificar el clima para nuestro lugar. El ``escenario`` de cambios climáticos sirve para simulaciones del futuro (taqdir obtendrá automáticamente los datos de cambios climáticos; ver `aquí <https://taqdir.readthedocs.io/es/latest/nmune/mrksm5.html>`_).
hi: बाद हम :class:`~tinamit.mod.clima.Clima` नाम का वर्ग का एक वस्तु बनाएंगी, जिस से हम अपना स्थान का जलवायु को निर्दिष्ट करेंगी। जलवायु परिवर्तन का परिदृश्य (``escenario``) भविष्य के अनुकार के लिये उपयोग होगा (तकदीर जलवायु परिवर्तन के आंकड़ों खुद पाएगा, `यहाँ <https://taqdir.readthedocs.io/es/latest/nmune/mrksm5.html>`_ पढ़ना)।

source: from tinamit.mod.clima import Clima mi_clima = Clima(lat=31.569, long=74.355, elev=10, escenario='8.5') t = EspecTiempo(365*50, f_inic='2020-01-01') mod.simular(t, clima=mi_clima)
hi: from tinamit.mod.clima import Clima as जलवायु मेरा_जलवायु = जलवायु(lat=31.569, long=74.355, elev=10, escenario='८.५') स = EspecTiempo(365*50, f_inic='२०२०-०१-०१') प्रतिरूप.simular(स, clima=मेरा_जलवायु)

source: Si tienes tus propios datos observados, también los puedes incluir en el parámetro ``fuentes`` que corresponde directamente al parámetro ``ذرائع`` de taqdir.
hi: अगर आपके पास खुद के प्रेक्षण हैं, तो ``fuentes`` नाम का विकल्प में उन्हें शामिल कर दे सकते हैं, जो सीधे तकदीर का ``ذرائع`` नाम के विकल्प को दिये जाएंगे।

source: from تقدیر.ذرائع import جےسن as Json fuente = Json('DatosDeMiEstaciónClimáticaPrivadaQueNoVoyACompartirConNadie.json', 31.569, 74.355, 100) mod.simular(t, clima=Clima(lat=31.569, long=74.355, elev=10, escenario='8.5', fuentes=(fuente,)))
hi: from تقدیر.ذرائع import جےسن as जेसान स्रोत = जेसान('मेरे खुद के जलवायु के अंकड़ों जो किसी और को भी नहीं देनेवाला हूँ.json', 31.569, 74.355, 100) प्रतिरूप.simular(स, clima=Clima(lat=31.569, long=74.355, elev=10, escenario='८.५', fuentes=(स्रोत,)))

source: Te recomendamos que leas la documentación de taqdir si quieres poder aprovechar te todas sus funcionalidades (extensión de datos, interpolación geográfica, desagregación temporal y mucho más).
hi: हम आपको तकदीर के प्रलेखन पढ़ने की सिफारिश करते हैं अगर आप उसके सारे कार्यक्षमते का फाय्दा लेने चाहते हैं (जैसे के आंकड़ा विस्तार, भौगोलिक प्रक्षेप, समय विघटन और बहुत अधिक)।
