Repository: julienmalard/Tinamit
Catalog: docs/source/_local/*/LC_MESSAGES/tutorial/conex.po
Languages: hi

source: Conectar modelos
hi: प्रतिरूपों की जोड़ाई

source: Ejemplo muy básico
hi: सरल उदाहरण

source: Empezaremos con un modelo bastante sencillo. Pero demuestra muy bien cómo funciona Tinamït, y no tienes que instalar cualquier modelo biofísico externo para que te funcione, así que empecemos con este.
hi: हम एक काफी सरल नमूना मे शुरू करेंगे। फिर भी तीनामित के सुविधाऔं अच्छी तरफ़ से समझाता है। इसके उपर उसको चलाने के लिये आपको अपना संगणक पर किसी बाहरी वतावरण का प्रतिरूप की स्थापना करने की अवश्यकता होगी नहीं।

source: Primero vamos a utilizar este modelo de dinámicas de sistemas:
hi: हम इस प्रणाली गतिशील का प्रतिरूप का प्रयोग करेंगे।

source: El modelo DS determina, dado la lluvia, la cantidad de pesca posible y su impacto en la necesidad de explotar recursos del bosque.
hi: प्रणाली गतिशील का प्रतिरूप बारिश के अनुसार मछली पकड़ना के मौके और जंगल संसाधनों का प्रयोग करने की अवश्यकता पर इसका प्रभाव बताता है।

source: Del otro lado, el "modelo" biofísico nos da la precipitación según la cubertura forestal.
hi: हम्हारा वतावरण का प्रतिरूप वन आवरण के अनुसर बारिश बताता है।

source: import matplotlib.pyplot as plt from tinamit.conect import Conectado from tinamit.ejemplos import obt_ejemplo mds = obt_ejemplo('sencillo/mds_bosques.mdl') bf = obt_ejemplo('sencillo/bf_bosques.py') modelo = Conectado(bf=bf, mds=mds) # Vamos a conectar los variables necesarios modelo.conectar(var_mds='Lluvia', var_bf='Lluvia', mds_fuente=False) modelo.conectar(var_mds='Bosques', var_bf='Bosques', mds_fuente=True) # Y simulamos res_conex = modelo.simular(200) # Visualizar f, (eje1, eje2) = plt.subplots(1, 2) eje1.plot(res_conex['mds']['Bosques'].vals) eje1.set_title('Bosques') eje1.set_xlabel('Meses') eje2.plot(res_conex['mds']['Lluvia'].vals) eje2.set_title('Lluvia') eje2.set_xlabel('Meses') eje1.ticklabel_format(axis='y', style='sci', scilimits=(0,0))
hi: import matplotlib.pyplot as plt from tinamit.conect import Conectado as जु़ड़ा_हुआ from tinamit.ejemplos import obt_ejemplo as उदाहरण_पाना प्रण = उदाहरण_पाना('sencillo/mds_bosques.mdl') वता = उदाहरण_पाना('sencillo/bf_bosques.py') प्रतिरूप = जु़ड़ा_हुआ(bf=वता, mds=प्रण) # परिवर्तनशील को जोड़ा देंगे प्रतिरूप.conectar(var_mds='Lluvia', var_bf='Lluvia', mds_fuente=False) प्रतिरूप.conectar(var_mds='Bosques', var_bf='Bosques', mds_fuente=True) # प्रतिरूप चलाना परिणाम_जुड़ी = प्रतिरूप.simular(200) # चित्र चि, (अक्ष१ , अक्ष२) = plt.subplots(1, 2) अक्ष१.plot(परिणाम_जुड़ी['mds']['Bosques'].vals) अक्ष१.set_title('वन आवरण') अक्ष१.set_xlabel('महिने') अक्ष२.plot(res_conex['mds']['Lluvia'].vals) अक्ष२.set_title('बारिश') अक्ष२.set_xlabel('महिने') अक्ष१.ticklabel_format(axis='y', style='sci', scilimits=(0,0))

source: (`Source code <../tutorial/conex-1.py>`__, `png <../tutorial/conex-1.png>`__, `hires.png <../tutorial/conex-1.hires.png>`__, `pdf <../tutorial/conex-1.pdf>`__)
hi: (`स्रोत <../tutorial/conex-1.py>`__, `png <../tutorial/conex-1.png>`__, `hires.png <../tutorial/conex-1.hires.png>`__, `पी डी एफ <../tutorial/conex-1.pdf>`__)

source: Tambiém comparemos a una corrida sin conexión para ver el impacto de incluir las relaciones entre ambiente y humano.
hi: इसके बाद हम संबध के सिवा प्रतिरूप चला सकते हैं इसे देखने के लिये कि वतावरण और इनसान के संबध को शामिल करना का क्या। प्रभाव।

source: Siendo subclases de :class:`~tinamit.mod.Modelo`, modelos BF (:class:`~tinamit.envolt.bf.ModeloBF`) y DS (:class:`~tinamit.envolt.mds.ModeloDS`) también se pueden simular de manera independiente.
hi: वतावरण (:class:`~tinamit.envolt.bf.ModeloBF`) और प्रणाली गतिशील (:class:`~tinamit.envolt.mds.ModeloDS`) के प्रतिरूप दोनों प्रतिरूप (:class:`~tinamit.mod.Modelo`) के उपवर्ग होने से ये स्वतंत्र तरह से भी चल सकते हैं।

source: from tinamit.envolt.mds import gen_mds from tinamit.envolt.bf import gen_bf res_mds = gen_mds(mds).simular(200, nombre='Corrida_MDS') res_bf = gen_bf(bf).simular(200, nombre='Corrida_BF') # Visualizar f, (eje1, eje2) = plt.subplots(1, 2) eje1.plot(res_conex['mds']['Bosques'].vals, label='Conectado') eje1.plot(res_mds['Bosques'].vals, label='Individual') eje1.set_title('Bosques') eje1.set_xlabel('Meses') eje1.ticklabel_format(axis='y', style='sci', scilimits=(0,0)) eje2.plot(res_conex['mds']['Lluvia'].vals) eje2.plot(res_bf['Lluvia'].vals) eje2.set_title('Lluvia') eje2.set_xlabel('Meses') f.legend()
hi: from tinamit.envolt.mds import gen_mds as प्रण_उत्पन्न from tinamit.envolt.bf import gen_bf as वता_उत्पन्न परिणाम_प्रण = प्रण_उत्पन्न(प्रण).simular(200, nombre='प्रणाली') परिणाम_वता = वता_उत्पन्न(वता).simular(200, nombre='वतावरण') # चित्र चि, (अक्ष१, अक्ष२) = plt.subplots(1, 2) eje1.plot(परिणाम_जुड़ी['mds']['Bosques'].vals, label='जुड़ी हुई') eje1.plot(परिणाम_प्रण['Bosques'].vals, label='स्वतंत्र') eje1.set_title('वन आवरण') eje1.set_xlabel('महिने') eje1.ticklabel_format(axis='y', style='sci', scilimits=(0,0)) अक्ष२.plot(परिणाम_जुड़ी['mds']['Lluvia'].vals) अक्ष२.plot(परिणाम_वता['Lluvia'].vals) अक्ष२.set_title('बारिश') अक्ष२.set_xlabel('महिने') चि.legend()

source: (`Source code <../tutorial/conex-2.py>`__, `png <../tutorial/conex-2.png>`__, `hires.png <../tutorial/conex-2.hires.png>`__, `pdf <../tutorial/conex-2.pdf>`__)
hi: (`स्रोत <../tutorial/conex-2.py>`__, `png <../tutorial/conex-2.png>`__, `hires.png <../tutorial/conex-2.hires.png>`__, `पी डी एफ़ <../tutorial/conex-2.pdf>`__)

source: Opciones de tiempo
hi: समय विकल्प

source: Si quieres más control sobre los detalles del eje de tiempo, puedes pasar un objeto :class:`~tinamit.tiempo.tiempo.EspecTiempo` a la función :func:`~tinamit.mod.Modelo.simular`. Allí puedes especificar no solo el número de paso sino también una fecha inicial (útil para corridas con datos o clima externo), el tamaño de cada paso, y la frequencia con cual se guardan los resultados.
hi: अगर आप अपना प्रतिरूप के समय के अक्ष के विकल्प पर और भी नियंत्रण चाहती हैं, तो :class:`~tinamit.tiempo.tiempo.EspecTiempo` नाम का वर्ग का एक वस्तु :func:`~tinamit.mod.Modelo.simular` फलन। को दे सकती हैं। इस तरह से कदम की संख्या, प्रारंभिक तारिख (बाहरी आंकड़ों या जलवायु की जोड़ाई के लिये उपयोगी), कदम की आकार, और परिणाम बचाने की आवृत्ति का निर्दिष्ट कर सकती हैं।

source: from tinamit.tiempo.tiempo import EspecTiempo t = EspecTiempo(100, f_inic='2000-01-01', tmñ_paso=1, guardar_cada=1) modelo.simular(t)
hi: from tinamit.tiempo.tiempo import EspecTiempo स = EspecTiempo(100, f_inic='२०००-०१-०१', tmñ_paso=1, guardar_cada=1) प्रतिरूप.simular(स)

source: Unidades de tiempo
hi: समय का एकता

source: Tinamït se encargará de convertir entre unidades de tiempo para ti si difieren entre tus modelos. No obstante, si uno de tus modelos tiene unidad de tiempo no convencional o está en un idioma que Tinamït no reconoce, puede ser que tengas que especificar la conversión manualmente con :func:`~tinamit.unids.nueva_unidad`, :func:`~tinamit.unids.agregar_trad` o :func:`~tinamit.unids.agregar_sinónimos`.
hi: अगर आपके प्रतिरूप के समय के एकता में अंतर है, तीनामित उनके स्वचालित रूपांतर करेगा। फिर भी, अगर आपके प्रतिरूप के समय का एकता अपरंपरागत हो या तीनामित को अज्ञात भाषा में हो, :func:`~tinamit.unids.nueva_unidad`, :func:`~tinamit.unids.agregar_trad` या :func:`~tinamit.unids.agregar_sinónimos` नाम के फलन से आपको रूपांतर का निर्दिष्ट खुद करने पड़ेगा।

source: from tinamit.unids import nueva_unidad, agregar_trad, agregar_sinónimos # Una estación tiene 4 meses nueva_unidad(unid='Estación', ref='Mes', conv=4) # "día" se dice "நாள்" en Tamil agregar_trad('día', 'நாள்', leng_trad='த', leng_orig='es', guardar=True) # "தினம்" también quiere decir "día" en Tamil agregar_sinónimos('நாள்', "தினம்", leng='த', guardar=True)
hi: from tinamit.unids import nueva_unidad as नया_एकता, agregar_trad as अनुवाद_जोड़ाना, agregar_sinónimos as पर्याय_जोड़ाना # १ मौसम में ४ महिने हैं नया_एकता(unid='मौसम', ref='Mes', conv=4) # "día" को तमिल में "நாள்" कहते हैं अनुवाद_जोड़ाना('día', 'நாள்', leng_trad='த', leng_orig='es', guardar=True) # "தினம்" का मतलब भी है पर्याय_जोड़ाना('நாள்', "தினம்", leng='த', guardar=True)

source: Tinamït reconoce las unidades de tiempo siguientes: ``año``, ``mes``, ``semana``, ``día``, ``hora``, ``minuto``, ``secundo``, ``microsecundo``, ``millisecundo``, y ``nanosecundo``.
hi: तीनामित को निम्नलिखत समय के एकता समझ आते हैं: ``año``, ``mes``, ``semana``, ``día``, ``hora``, ``minuto``, ``secundo``, ``microsecundo``, ``millisecundo``, एवं ``nanosecundo``.

source: 3+ modelos
hi: ३+ प्रतिरूप

source: Si tienes más que 2 modelos para conectar, también es fácil con la clase :class:`~tinamit.conect.SuperConectado`. Se pueden conectar de manera horizontal o jerárquica, cómo prefieres.
hi: अगर आप२ प्रतिरूप से ज़्यादा ज़ोड़ाने चाहते हैं, यह भी :class:`~tinamit.conect.SuperConectado` नाम का वर्ग के साथ आसान हो जाता है। क्षैतिज या श्रेणीबद्ध तरह से जुड़े जा सकते हैं।

source: Horizontal
hi: क्षैतिज

source: Se pueden conectar modelos individuales de manera "horizontal" en un solo modelo :class:`~tinamit.conect.SuperConectado`.
hi: विभिन्न प्रतिरूप क्षैतिज तरह से एक ही :class:`~tinamit.conect.SuperConectado` का प्रतिरूप में जुड़े जा सकते हैं।

source: from tinamit.conectado import SuperConectado # Crear los 3 modelos mod_1 = MiModelo1(nombre='modelo 1') mod_2 = MiModelo2(nombre='modelo 2') mod_3 = MiModelo3(nombre='modelo 3') # El Conectado conectado = SuperConectado([mod_1, mod_2, mod_3]) # Conectar variables entre dos de los modelos por el intermediario del tercero. conectado.conectar_vars( var_fuente='Var 1', modelo_fuente='modelo 1', var_recip='Var 2', modelo_recip='modelo 2' ) conectado.conectar_vars( var_fuente='Var 2', modelo_fuente='modelo 2', var_recip='Var 3', modelo_recip='modelo 3' ) # Simular res = conectado.simular(10, vars_interés=[mod_1.variables['Var 1'], mod_3.variables['Var 3']])
hi: from tinamit.conectado import SuperConectado as महाजुड़ा_हुआ # ३ प्रतिरूप बनाना प्रति_१= मेराप्रतिरूप१(nombre='प्रतिरूप १') प्रति_२ = मेराप्रतिरूप२(nombre='प्रतिरूप २') प्रति_३ = मेराप्रतिरूप३(nombre='प्रतिरूप ३') # जुड़ा हूआ प्रतिरूप प्रतिरूप = महाजुड़ा_हुआ([प्रति_१, प्रति_२, प्रति_३]) # परिवर्तनशील की जोड़ाई प्रतिरूप.conectar_vars( var_fuente='Var 1', modelo_fuente='प्रतिरूप १', var_recip='Var 2', modelo_recip='प्रतिरूप २' ) प्रतिरूप.conectar_vars( var_fuente='Var 2', modelo_fuente='प्रतिरूप २', var_recip='Var 3', modelo_recip='प्रतिरूप ३' ) # चलाना परिणाम = प्रतिरूप.simular(10, vars_interés=[प्रति_१.variables['Var 1'], प्रति_३.variables['Var 3']])

source: Los variables ``Var 1`` del ``modelo 1`` y ``Var 3`` del ``modelo 3`` ahora tendrán valores idénticos a través de la simulación.
hi: अब, ``प्रतिरूप १`` का ``Var 1`` नाम का परिवर्तनशील और ``प्रतिरूप ३`` का ``Var 3`` के मूल्य पूरी अनुकार में एक जैसे ही हेंगे।

source: Jerárquica
hi: श्रेणीबद्ध

source: También se pueden anidar modelos adentro de otros.
hi: प्रतिरूप एक दूसरे के अंदर भी लगा सकते हैं।

source: # Los tres modelos mod_1 = MiModelo1(nombre='modelo 1') mod_2 = MiModelo2(nombre='modelo 2') mod_3 = MiModelo3(nombre='modelo 3') # El primer Conectado conectado_sub = SuperConectado(nombre='sub', modelos=[mod_1, mod_2]) conectado_sub.conectar_vars( var_fuente='Var 1', modelo_fuente='modelo 1', var_recip='Var 2', modelo_recip='modelo 2' ) # El segundo Conectado conectado = SuperConectado([conectado_sub, mod_3]) conectado.conectar_vars( var_fuente=mod_2.variables['Var2'], var_recip='Var 3', modelo_recip='modelo 3' ) # Correr la simulación res = conectado.simular(10, vars_interés=[mod_1.variables['Var 1'], mod_3.variables['Var 3']])
hi: # ३ प्रतिरूप बनाना प्रति_१= मेराप्रतिरूप१(nombre='प्रतिरूप १') प्रति_२ = मेराप्रतिरूप२(nombre='प्रतिरूप २') प्रति_३ = मेराप्रतिरूप३(nombre='प्रतिरूप ३') # पहला जुड़ा हुआ प्रतिरूप जुड़ा_हुआ_१ = महाजुड़ा_हुआ(nombre='पहला', modelos=[mod_1, mod_2]) जुड़ा_हुआ_१.conectar_vars( var_fuente='Var 1', modelo_fuente='प्रतिरूप १', var_recip='Var 2', modelo_recip='प्रतिरूप २' ) # दुसरा जुड़ा हुआ प्रतिरूप जुड़ा_हुआ = महाजुड़ा_हुआ([जुड़ा_हुआ_१, प्रति_३]) जुड़ा_हुआ.conectar_vars( var_fuente=प्रति_२.variables['Var2'], var_recip='Var 3', modelo_recip='प्रतिरूप ३' ) # अनुकार चलाना परिणाम = जुड़ा_हुआ.simular(10, vars_interés=[प्रति_१.variables['Var 1'], प्रति_३.variables['Var 3']])

source: Este código dará resultados idénticos a los del ejemplo horizontal arriba.
hi: ३ प्रतिरूप जोड़ाने के दोनों तरह के परिणाम एक ही होंगे।
