Repository: julienmalard/Tinamit
Catalog: docs/source/_local/*/LC_MESSAGES/tutorial/mapas.po
Languages: hi

source: Mapas
hi: नक्षे

source: Tinamït viene con algunas funcionalidades para dibujar mapas de resultados de simulación. Todos los mapas están compuestos de objetos :class:`~tinamit.geog.mapa.Forma`. Cada :class:`~tinamit.geog.mapa.Forma` está vinculada con un archivo ``.shp``.
hi: तीनामित में अनुकार के परिणाम के नक्षे बनाने के कार्यक्षमते मिलेंगे। हर। नक्षा :class:`~tinamit.geog.mapa.Forma` वर्ग के वस्तु से बना है। हर :class:`~tinamit.geog.mapa.Forma` को एक ``.shp`` का संचिका के साथ संबंध है।

source: Formas dinámicas
hi: गतिशील आकार

source: Formas dinámicas (:class:`~tinamit.geog.mapa.FormaDinámica`) son las formas cuyos colores varían según los resultados de una simulación. Incluyen :class:`~tinamit.geog.mapa.FormaDinámicaNumérica`, la cual toma sus valores en formato de ``np.ndarray`` o de lista, y :class:`~tinamit.geog.mapa.FormaDinámicaNombrada`, la cual quiere sus datos en formato de diccionario.
hi: गतिशील आकार (:class:`~tinamit.geog.mapa.FormaDinámica`) के रंग अनुकार के परिणाम के अनुसर बदलते हैं। इन में से हैं :class:`~tinamit.geog.mapa.FormaDinámicaNumérica`, जिनके मूल्य ``np.ndarray`` या सुची के रूप में देना है, और :class:`~tinamit.geog.mapa.FormaDinámicaNombrada`, जिनके मूल्य शब्दकोश में देना है।

source: Los mapas se pueden dibujar desde una matriz de un variable multidimensional en un modelo, o sino de una simulación de grupo donde cada simulación individual representa otra región en el mapa. Ambas situaciones se manejan por :func:`~tinamit.geog.mapa.dibujar_mapa_de_res`.
hi: नक्षे एक बहुआयामी परिवर्तनशील के आव्यूह या एक समूह अनुकार (जिस में हर एक अनुकार नक्षा का एक क्षेत्र का प्रतिनिधित्व करता है) से बने जा सकते हैं। दोनों :func:`~tinamit.geog.mapa.dibujar_mapa_de_res` नाम का फलन के बने जाते हैं।

source: Simulaciones por grupo
hi: समूह के अनुकार

source: En este ejemplo, correremos un modelo de epidemiología con distintas tazas de contacto para cada departamento de Guatemala.
hi: इस नमूना में, हम एक महामारी का प्रतिरूप ग्वाटेमाला के हर एक प्रदेश में विभिन्न संपर्क के दर के साथ चलाएंगे।

source: import numpy as np from tinamit.ejemplos import obt_ejemplo from tinamit.envolt.mds import gen_mds from tinamit.geog.mapa import FormaDinámicaNombrada, dibujar_mapa_de_res from tinamit.mod import OpsSimulGrupo mds = gen_mds(obt_ejemplo('enfermedad/mod_enferm.mdl')) forma_deptos = obt_ejemplo('geog_guate/deptos.shp') ops = OpsSimulGrupo( t=50, extern=[{'taza de contacto': np.random.random() * 500} for i in range(1, 23)], nombre=[str(i) for i in range(1, 23)] ) res = mds.simular_grupo(ops, nombre='Epidemiología') frm = FormaDinámicaNombrada(forma_deptos, col_id='COD_DEP', escala_colores=-1) dibujar_mapa_de_res(forma_dinámica=frm, res=res, var='Individuos Infectados', t=16)
hi: import numpy as np from tinamit.ejemplos import obt_ejemplo as नमूना_पाना from tinamit.envolt.mds import gen_mds as प्रण_प्रजनन from tinamit.geog.mapa import FormaDinámicaNombrada as नामित_गतिशील_आकार, dibujar_mapa_de_res as परिणाम_से_नक्षा from tinamit.mod import OpsSimulGrupo as समूह_अनुकार_विकल्प प्रण = प्रण_प्रजनन(नमूना_पाना('enfermedad/mod_enferm.mdl')) प्रदेश_आकार = नमूना_पाना('geog_guate/deptos.shp') विकल्प = समूह_अनुकार_विकल्प( t=50, extern=[{'taza de contacto': np.random.random() * 500} for i in range(1, 23)], nombre=[str(i) for i in range(1, 23)] ) परिणाम = प्रण.simular_grupo(विकल्प, nombre='Epidemiología') आकार = नामित_गतिशील_आकार(प्रदेश_आकार, col_id='COD_DEP', escala_colores=-1) परिणाम_से_नक्षा(forma_dinámica=आकार, res=परिणाम, var='Individuos Infectados', t=16)

source: (`Source code <../tutorial/mapas-1.py>`__, `png <../tutorial/mapas-1.png>`__, `hires.png <../tutorial/mapas-1.hires.png>`__, `pdf <../tutorial/mapas-1.pdf>`__)
hi: (`स्रोत <../tutorial/mapas-1.py>`__, `पी एन जी <../tutorial/mapas-1.png>`__, `hires.png <../tutorial/mapas-1.hires.png>`__, `पी डी एफ़ <../tutorial/mapas-1.pdf>`__)

source: El nombre de cada simulación en el grupo debe corresponder con el nombre de una forma en el archivo ``.shp`` tal como especificado en la columna ``col_id``.
hi: समूह का हर अनुकार का नाम ``.shp`` संचिका में ``col_id`` का स्तंभ में एक आकार का नाम से बराबर होने चाहिये।

source: Alternativamente, puedes utilizar una :class:`~tinamit.geog.mapa.FormaDinámicaNumérica`; en ese caso se asiñarán los resultados a las formas según su orden en ``OpsSimulGrupo``, nada más.
hi: न तो, आप एक :class:`~tinamit.geog.mapa.FormaDinámicaNumérica` का प्रयोग कर सकती हैं। इस मामले में, प्रणाम और आकार का सौंपा ``OpsSimulGrupo`` में आकार के क्रम के अनुसार से किया जाएगा।

source: Variables multidimensionales
hi: बहुआयामी परिवर्तनशील

source: Aplicaremos un modelo sencillo de bosques y lluvia a un mapa de la región del Rechna Doab (رچنا دوآب) en Pakistán. Este mapa divide la región en 215 polígonos, cada cual corresponde a un punto en el variable ``Bosque`` multidimensional.
hi: हम यहाँ एक सरल वन आवरण और बारिश का प्रतिरूप से पाकिस्तान का रेचना दोआब (رچنا دوآب) का क्षेत्र का एक नक्षा को लगाएँगे। यह नक्षा क्षेत्र को २१५ विभिन्न बहुभूज में विभाजित कर देता है, जिसका हर एक बहुभूज ``Bosque`` नाम का बहुआयामी परिवर्तनशील का एक बंदु का अनुरूप है।

source: from tinamit.ejemplos.sencillo.bf_bosques import PruebaBF from tinamit.geog.mapa import FormaDinámicaNumérica mod = PruebaBF(215) polígonos = obt_ejemplo('rechna_doab/polígonos.shp') extern = {'Bosques': np.random.random(215)*1e6} res = mod.simular(t=10, extern=extern, nombre='Cobertura forestal') frm = FormaDinámicaNumérica(polígonos, col_id='Id') dibujar_mapa_de_res(forma_dinámica=frm, res=res, var='Bosques', t=10)
hi: from tinamit.ejemplos.sencillo.bf_bosques import PruebaBF as नमूना_वतावरण from tinamit.geog.mapa import FormaDinámicaNumérica as सूचीबद्ध_गतिशील_आकार प्रतिरूप = नमूना_वतावरण(215) बहुभूज = नमूना_पाना('rechna_doab/polígonos.shp') बाहरी = {'Bosques': np.random.random(215)*1e6} परिणाम = प्रतिरूप.simular(t=10, extern=बाहरी, nombre='वन आवरण') आकार = सूचीबद्ध_गतिशील_आकार(बहुभूज, col_id='Id') परिणाम_से_नक्षा(forma_dinámica=आकार, res=परिणाम, var='Bosques', t=10)

source: (`Source code <../tutorial/mapas-2.py>`__, `png <../tutorial/mapas-2.png>`__, `hires.png <../tutorial/mapas-2.hires.png>`__, `pdf <../tutorial/mapas-2.pdf>`__)
hi: (`स्रोत <../tutorial/mapas-2.py>`__, `पी एन जी <../tutorial/mapas-2.png>`__, `hires.png <../tutorial/mapas-2.hires.png>`__, `पी डी एफ़ <../tutorial/mapas-2.pdf>`__)

source: Formas estáticas
hi: स्थिर आकार

source: También puedes agregar formas estáticas (:class:`~tinamit.geog.mapa.FormaEstática`), que no depienden de los resultados de una simulación y que se agregan solamente por razones estéticas.
hi: स्थिर आकार (:class:`~tinamit.geog.mapa.FormaEstática`) जोड़े जा सकते हैं। इनको अनुकार के परिणाम के साथ कोई संपर्क नहीं होता और केवल सौंदर्य कारण से जोड़े जाते हैँ।

source: Por el momento, tienes:
hi: अब तक, यह उपलब्ध हैं।

source: Cuerpos de agua: :class:`~tinamit.geog.mapa.Agua`
hi: पानी: :class:`~tinamit.geog.mapa.Agua`

source: Bosques: :class:`~tinamit.geog.mapa.Bosque`
hi: जंगल: :class:`~tinamit.geog.mapa.Bosque`

source: Calles: :class:`~tinamit.geog.mapa.Calle`
hi: सड़क: :class:`~tinamit.geog.mapa.Calle`

source: Zonas urbanas: :class:`~tinamit.geog.mapa.Ciudad`
hi: शहर: :class:`~tinamit.geog.mapa.Ciudad`

source: from tinamit.geog.mapa import Agua, Calle calles = Calle(obt_ejemplo('rechna_doab/calle.shp')) río = Agua(obt_ejemplo('rechna_doab/río.shp')) canales = Agua(obt_ejemplo('rechna_doab/canal.shp'), llenar=False) dibujar_mapa_de_res(forma_dinámica=frm, otras_formas=[calles, canales, río], res=res, var='Bosques', t=10)
hi: from tinamit.geog.mapa import Agua as पानी, Calle as सड़क सड़क_प्रणाली = सड़क(नमूना_पाना('rechna_doab/calle.shp')) नदि = पानी(नमूना_पाना('rechna_doab/río.shp')) नहर = पानी(नमूना_पाना('rechna_doab/canal.shp'), llenar=False) परिणाम_से_नक्षा(forma_dinámica=आकार, otras_formas=[सड़क_प्रणाली, नहर, नदि], res=परिणाम, var='Bosques', t=10)

source: (`Source code <../tutorial/mapas-3.py>`__, `png <../tutorial/mapas-3.png>`__, `hires.png <../tutorial/mapas-3.hires.png>`__, `pdf <../tutorial/mapas-3.pdf>`__)
hi: (`स्रोत <../tutorial/mapas-3.py>`__, `पी एन जी <../tutorial/mapas-3.png>`__, `hires.png <../tutorial/mapas-3.hires.png>`__, `पी डी एफ़ <../tutorial/mapas-3.pdf>`__)
