Repository: julienmalard/Tinamit
Catalog: docs/source/_locale/*/LC_MESSAGES/docu/Conectado.po
Languages: ur

source: Conectado
ur: منسلک

source: Esta clase representa un tipo especial de modelo :class:`~tinamit.Conectado.SuperConectado`: la conexión entre un modelo biofísico y un modelo DS.
ur: یہ کلاس میں ایک خاص قسم کی ماڈل کو ظاہر کرتی ہے :class:`ٹنامٹ ۔ کانکٹاڈو ۔ سپر کانکٹاڈو <tinamit.Conectado.SuperConectado>`: ۔ایک بائیوفیکیکل ۔ماڈل اور ایک متحرک نظام ماڈل کو جوڑنے کے ليے

source: Una función para conectar variables entre el modelo biofísico y el modelo DS.
ur: بائیو فیزیکل ماڈل اور متحرک نظام ماڈل کو متغیرات کےذريعے منسلک کرنے کے لئے ایک فعل

source: Parámetros
ur: متغیرات

source: El nombre del variable en el modelo DS.
ur: متحرک نظام ماڈل میں متغیر کا نام ۔

source: El nombre del variable correspondiente en el modelo biofísico.
ur: بائیوفیسیکل ماڈل میں متغیر کا نام۔

source: Si ``True``, el modelo DS es el modelo fuente para la conexión. Sino, será el modelo biofísico.
ur: اگر ``True`` ہے، تو متحرک نظام ماڈل کے کنکشن کے ذریعہ ماخذ ماڈل ہے. دوسری صورت میں، یہ بائیوفیکیکل ماڈل ہو گا۔

source: El factor de conversión entre los variables.
ur: ان متغیروں کے درمیان تبدیلی کا عنصر

source: Esta función deshacer una conexión entre el modelo biofísico y el modelo DS. Se especifica la conexión por el nombre del variable en el modelo DS.
ur: يہ فعل بائیفیسکلیکل ماڈل اور متحرک نظام ماڈل کے درمیان کنکشن کو غیر مستحکم کرتا ہے۔ کنکشن متحرک نظام ماڈل میں متغیر کے نام سے مخصوص کیا جاتا ہے ۔

source: El nombre del variable conectado en el modelo DS.
ur: متغیر کا نام متحرک نظام ماڈل میں منسلک ہے.

source: Establece el modelo biofísico (:class:`~tinamit.BF.EnvolturaBF`).
ur: بائیوفیسیکل ماڈل (`class:`tinamit.BF.EnvolturaBF:) قائم کرتا ہے۔

source: El archivo con la clase del modelo biofísico. **Debe** ser un archivo de Python.
ur: بائیوفیسیکل ماڈل کی کلاس کے ساتھ فائل ضروری ہے۔ پيتھان ميں دستاويز بنا‏ ئیں ۔

source: Establecemos el modelo de dinámicas de los sistemas (:class:`~tinamit.MDS.EnvolturaMDS`).
ur: (:class:`ٹنامٹ۔ ایم ڈی ایس ۔ انوالٹوراایم ڈی ایس <tinamit.MDS.EnvolturaMDS>`) يہ نظام کے متحرک ماڈل قائم کرتے ہیں۔

source: El archivo del modelo DS.
ur: متحرک نظام ماڈل دستاويز.

source: Esta clase representa el más alto nivel posible de modelo conectado. Tiene la función muy útil de poder conectar instancias de sí misma, así permitiendo la conexión de números arbitrarios de modelos.
ur: اس طبقے سے منسلک ماڈل کی سب سے زیادہ ممکنہ سطح پر نمائندگی کرتا ہے. اس کے پاس بہت سارے مفادات ہیں جو خود کی مثال سے منسلک کرنے کے قابل ہیں، اس طرح ماڈل کے خود مختار نمبروں کے سلسلے کی اجازت دیتا ہے.

source: Actualiza los variables climáticos según la fecha.
ur: تاریخ کے مطابق موسمی متغیرات کو تازہ کریں

source: El número de pasos en adelante para cuales tenemos que obtener predicciones.
ur: آگے بڑھنے کے سلسلے کی تعداد پیش گوئی حاصل کرنے کے لئے۔

source: La fecha actual.
ur: موجودہ تاریخ

source: Esta función cambia los valores del modelo. A través de la función :func:`~tinamit.Conectado.cambiar_vals`, se vuelve recursiva.
ur: کے ذریعے متغیرات کو دوبارہ پڑ ھتا ہے ۔ :func:`ٹنامٹ ۔ کانکٹاڈو۔ کامبیر_ وال <tinamit.Conectado.cambiar_vals>` یہ فعل ماڈل کی اقدار کو تبدیل کرتی ہے۔ یہ فعل

source: El diccionario de nombres de variables para cambiar. Hay que prefijar cada nombre de variable con el nombre del submodelo en en cual se ubica (separados con un ``_``), para que Tinamit sepa en cuál submodelo se ubica cada variable.
ur: متغیرات تبدیل کرنے کے لئے متغیرکے ناموں کی لغت. آپ کو ہر متغیرکے نام کو ذيلی ماڈل کے نام کے(ایک`` _`` کی طرف سے علیحدہ) ساتھ پیش کرنا ہوگا جس میں وہ موجود ہے۔ تاکہ ٹنامٹ جانتا ہو کہ ہر متغیر کہاں واقع ہے۔

source: Termina la simulación.
ur: تخروپن کو ختم کرتا ہے۔

source: Conecta variables entre los submodelos.
ur: متنوع کے درمیان متنوع متصل کریں.

source: Un diccionario especificando los variables de cada modelo en el formato {mod1: var, mod2: var}.
ur: {mod1: var, mod2: var}. ایک لغت کی شکل میں ہر ماڈل کے متغیرات کی وضاحت کرتا ہے۔

source: El nombre del modelo fuente.
ur: ماخذ ماڈل کا نام۔

source: La conversión entre las unidades de ambos modelos. En el caso ``None``, se intentará adivinar la conversión con el módulo `~tinamit.Unidades`.
ur: دونوں ماڈلوں کے یونٹس کے درمیان تبادلوں کے ليے۔ `ٹنامٹ ۔ يونیڈيڈس <tinamit.Unidades>`. ہے تو یہ ماڈیول کے ساتھ تبادلوں کا اندازہ لگانے کی کوشش کرے گی ۔ ``None``اگر

source: Esta función desconecta variables.
ur: یہ فعل متغیر سے منسلک ہے۔

source: El variable fuente de la conexión.
ur: متغیرکو جوڑنے کا ذریعہ ۔

source: El modelo fuente de la conexión.
ur: ماڈل کو جوڑنے کا ذریعہ

source: Esta función establece la conversión de tiempo entre los dos modelos (útil para unidades que Tinamit no reconoce).
ur: (یہ فعل ان دو ماڈلوں کے درمیان وقت کی تبدیلی کا تعین کرتا ہے (ٹنامٹ کے تسلیم شدہ یونٹس کے لئے مفید.

source: El modelo con la unidad de tiempo mayor.
ur: سب سے بڑے وقت کے یونٹ کے ساتھ ماڈل.

source: El factor de conversión con la unidad de tiempo del otro modelo.
ur: دوسرے ماڈل کے وقت کے یونٹ کے ساتھ تبادلوں کا عنصر.

source: Esta función agrega un modelo al SuperConectado. Una vez que dos modelos estén agregados, se pueden conectar y simular juntos.
ur: یہ فعل سپر کنکشن میں ایک ماڈل شامل کرتا ہے. ایک ایسے وقت جس میں دو ماڈل شامل کیے جاتے ہیں،تو ان کو ایک ساتھ منسلک اور ضم کر سکتے ہیں

source: El modelo para agregar.
ur: ماڈل شامل کرنے کے لئے۔

source: Esta función avanza los dos submodelos conectados de intervalo de tiempo ``paso``. Emplea el módulo :py:mod:`threading` para correr los dos submodelos en paralelo, así ahorando tiempo.
ur: يہ خصوصیت دو سب ماڈل کو جو وقت کےقدم کےساتھ بذريعہ " Paso" جوڑے ہوتے ہيں کو چالاتا ہے۔ان دو سب ماڈل کومتوازی چالانے کے ليے يہ ماڈيول :py:mod:`threading`استعال کرتا ہے تو آہورانڈو کا وقت

source: El intervalo de tiempo.
ur: وقت کا وقفہ

source: Esta función no es necesaria, porque :func:`~tinamit.Conectado.Conectado.estab_modelo` ya llama las funciones necesarias, :func:`~tinamit.Modelo.inic_vars` de los submodelos.
ur: :func:`~tinamit.Modelo.inic_vars` .پہلے ہی ذیلی ماڈیولز کے لازمی ضروری کام کرتا ہے :func:`~tinamit.Conectado.Conectado.estab_modelo` یہ فعل ضروری نہیں ہے، کیونکہ

source: Inicia el modelo en preparación para una simulación.
ur: ایک تخروپن کی تیاری کے لئے ماڈل شروع کریں

source: Actualizamos el diccionario de cconexiones rápidas para facilitar el intercambio eventual de valores entre los modelos.
ur: ہم ماڈل کے درمیان متغیرات کے ابتدائی تبادلہ کو آسان بنانے کے لئے تیز کنکشن کی لغت کو اپ ڈیٹ کرتے ہیں

source: Se organiza este diccionario por modelo fuente. Tendrá la forma general:
ur: یہ لغت ماخذ ماڈل کے ذریعہ منظم کیا جاتا ہے. اس کی عام شکل ہوگی

source: Leamos los valores de los variables de los dos submodelos. Por la conexión entre los diccionarios de variables de los submodelos y del :class:`~tinamit.Conectado.SuperConectado`, no hay necesidad de actualizar el diccionario del :class:`~tinamit.Modelo.SuperConectado` sí mismo.
ur: آئیے ان متغیرات عوامل کے دو ذیلی ماڈیولز کی اقدار کو پڑھیں ۔ذیلی ماڈلوں کے متغیرات کی لغات کے درمیان خود :class:`~tinamit.Modelo.SuperConectado`لغت کی تازہ کاری کرنے کی کوئی ضرورت نہیں ہے۔ :class:`~tinamit.Conectado.SuperConectado` رابطے کے لئے

source: Esta función devolverá las unidades de tiempo del modelo conectado. Dependerá de los submodelos. Si los dos submodelos tienen las mismas unidades, esta será la unidad del modelo conectado también. Si los dos tienen unidades distintas, intentaremos encontrar la conversión entre los dos y después se considerará como unidad de tiempo de base la más grande de los dos. Por ejemplo, si se conecta un modelo con una unidad de tiempo de meses con un modelo de unidad de año, se aplicará una unidad de tiempo de سال al modelo conectado.
ur: یہ فنکشن منسلک ماڈل کے وقت کے یونٹوں کوکنڑول کرے گا۔ یہ ذيلی ماڈلوں پر منحصر ہے۔ اگر دونوں ذيلی ماڈلوں کے يونيٹ يکساں ھوں گے تو يہ يونيٹ ماڈلوں کو جوڑے گا اور اگر دونوں ذيلی ماڈلوں کے يونيٹ مختلف ھوں گے تو يہ ان کے ليے تبادلہ تلاش کرنے کی کوشش کرے گا اور بڑے يونٹ کو لے گا۔ مثال کے طور پر، اگر ایک سال کے ایک یونٹ کے ساتھ مہینے کے وقت کا یونٹ منسلک ہوتا ہے تو، سال کا ایک یونٹ منسلک ماڈل پر لاگو کیا جائے گا.

source: Después se actualiza el variable símismo.conv_tiempo para guardar en memoria la conversión necesaria entre los pasos de los dos submodelos.
ur: ميں رھتا ہے جبتکہ دونوں ذيلی ماڈلوں ميں جو تبادلہ چاہيے نہ ھو جا ے símismo.conv_tiempo تازہ پن کے بعد متغیر یاداشت

source: Se emplea las clase `~tinamit.Unidades.Unidades` para convertir unidades.
ur: کلاس استعمال کی جاتی ہے `~tinamit.Unidades.Unidades` یونٹس کو تبدیل کرنے کے لئے

source: Devuelve
ur: واپسی

source: El tiempo de paso del modelo SuperConectado.
ur: ماڈل سپر منسلک کے قدم کا وقفہ

source: Tipo del valor devuelto
ur: واپس قیمت کی قسم

source: Simula el modelo :class:`~tinamit.Conectado.SuperConectado`.
ur: :class:`~tinamit.Conectado.SuperConectado` نمونہ ماڈل

source: El tiempo final de la simulación.
ur: تخروپن کا آخری وقت.

source: El paso (intervalo de intercambio de valores entre los dos submodelos).
ur: (قدم (دو ذیلی ماڈلوں کے متغیرات کے درمیان اقدار کے تبادلے کا وقفہ

source: El nombre de la corrida. El valor automático es ``Corrida Tinamit``.
ur: خود کار طريقہ سے کورراڈا ميں ا‏عداد کی تعداد کا تعين کر تی ہے`` Corrida Tinamit``

source: La fecha inicial de la simulación. Necesaria para simulaciones con cambios climáticos.
ur: تخروپن کی شروع کی تاریخ۔ اس کی آب و ہوا کے تبدیلی والے تخروپن کو چالانے ميں ضرورت پڑھے گی

source: El lugar de la simulación.
ur: تخروپن کا مقام

source: El escenario climático según el sistema de la IPCC (2.6, 4.5, 6.0, o 8.5)
ur: آب و ہوا کے منظر نامے، بین اقوامی موسمیاتی تبدیلی کی تنظیم کے لحاظ سے (٢.٦، ٤.٥، ٦.٠ یا ٨.٥).

source: Si quieres recalcular los datos climáticos, si ya existen.
ur: اگر آپ آب و ہوا کے ا‏عداد و شمار کا دوبارہ سے حساب کرنا چاہيں، اگر وہ پہلے سے وہاں موجود ھو

source: Si es una simulación de cambios climáticos o no.
ur: اگر آب و ہوا کی ايک تخروپن ہے يا نہيں
