Repository: julienmalard/Tinamit
Catalog: docs/source/_local/*/LC_MESSAGES/general/agrad.po
Languages: fa, hi, ta, ur

source: Agradecimientos
fa: قدردانی
hi: धन्यवाद
ta: இவர்களுக்கு நன்றி...
ur: شکریہ.

source: Tinamït es un proyecto de fuente abierta. Las personas e instituciones siguientes hicieron posible su desarrollo.
fa: تینامیت یک پروژه اپن سورس است. از این طریق موسسات و افراد دیگری که با تینامیت کار میکنند، امکان توسعه مدل را فراهم مینمایند.
hi: तीनामित मुफ्त स्रोत का काम है। उसका विकास निम्नलिखित इन्सान और संस्थान के कारण से संभाव हुआ।
ta: தீநாமித் ஒரு திறந்த மூல மென்பொருள் உள்ளது. இந்த மக்கள் மற்றும் நிலையங்களால் அதனுடைய வளர்ச்சி சாத்தியமாக உள்ளது.
ur: ٹنامٹ ایک کھلا ذریعہ منصوبہ ہے. مندرجہ ذیل لوگوں اور اداروں کی کاوشوں کی بدولت اس کی تخلیق ممکن ہو‏ ئی۔

source: Autores del código
fa: نویسندگان بسته نرم افزاری
hi: तीनामित के लेखक
ta: கணினி மாதிரி எழுத்தாளர்கள்
ur: کوڈ کے تخلیق کار۔

source: `Julien Malard <https://www.researchgate.net/profile/Julien_Malard>`_
hi: `ज़ूलीएँ मलर <https://www.researchgate.net/profile/Julien_Malard>`_
ur: `ژولیئں ملاغ <https://www.researchgate.net/profile/Julien_Malard>`_

source: `محمّد اظہر انعام بیگ (Muhammad Azhar Inam Baig) <https://www.researchgate.net/profile/Azhar_Baig>`_
hi: `محمّد اظہر انعام بیگ (मुहम्मद अज़ार इनाम बैग) <https://www.researchgate.net/profile/Azhar_Baig>`_
ur: `محمّد اظہر انعام بیگ <https://www.researchgate.net/profile/Azhar_Baig>`_

source: Autores de envolturas
fa: نویسنده بسته نرم افزاری
hi: लिफाफे के लेखक
ta: உறை எழுத்தாளர்கள்
ur: سانچے کے تخلیق کار

source: Gracias a los siguientes por escribir envolturas específicas a los modelos biofísicos siguientes (nota: escribimos las *envolturas* para que estos modelos sean compatibles con Tinamït, ¡no escribimos los modelos sí mismos!)
fa: با کمال تشکر از کسانی که بسته های خاص زیر را برای مدل های بیوفیزیکی مورد توجه قرار داده اند:( توجه کنید: ما * این بسته ها * را طوری نوشتیم تا با Tinamit سازگار شوند، یعنی خود مدل ها را ننوشته‏ ایم !)
hi: वतानरण के प्रतिरूप के खास लिफाफे लिखने के लिये निम्नलिखित इनसानों को धन्यवाद। (टिप्पणी- हमने इन प्रतिरूपों के तीनामित *लिफाफे* लिखे, और प्रतिरूप खुद नहीं।)
ta: உயிர் இயற்பியல் மாதிரிகளுக்கு குறிப்பிட்ட உறைகள் எழுதிறதற்கு இவர்களுக்கு நன்றி. குறிப்பு - இவர்களால் இந்த *மாதிரிகளுக்கு தினாமித்தின் உறைகள்* எழதப்பட்டன, இவர்களால் இந்த மாதிரிகள் எழதப்பட்டதில்லை.
ur: مندرجہ ذیل حیاتی طبیعیات ماڈلز کےسانچےلکھنے لئے مندرجہ ذیل تخلیق کاروں کا شکریہ: (نوٹ: ہم نے ان حیاتی طبیعیات ماڈلز کو سماجی معاشی ماڈلز بذريعہ ٹینامٹ ) (جوڑنے کے لئے٭ سانچے٭ بناے ہیں۔ حیاتی طبیعیات ماڈلز کی تخلیق کار ی میں ھمارا کوی کردار نہيں ھے

source: SAHYSMOD
fa: مدل فیزیکی SAHYASMOD
hi: साहिसमोड
ta: ஸாஹிஸ்மாட்
ur: ساھیسماڈ

source: محمّد اظہر انعام بیگ (Muhammad Azhar Inam Baig)
fa: محمد اظهر انعام بیگ
hi: محمّد اظہر انعام بیگ (मुहम्मद अज़ार इनाम बैग)
ta: محمّد اظہر انعام بیگ (முஹாம்மத் அஸ்ஹார் இனாம் பாயிக்)
ur: محمّد اظہر انعام بیگ

source: Julien Malard
fa: ژولین مالارد
hi: ज़ूलीएँ मलर
ta: ஜூலீஎன் மாலார்
ur: ژولئں ملار (Julien Malard)

source: Traductores
fa: مترجمان
hi: अनुवाद
ta: மொழிபெயர்ப்பாளர்கள்
ur: مترجم

source: اردو: محمّد اظہر انعام بیگ (Muhammad Azhar Inam Baig)
hi: اردو: محمّد اظہر انعام بیگ (मुहम्मद अज़ार इनाम बैग)
ur: اردو: محمّد اظہر انعام بیگ

source: தமிழ்: Julien Malard
hi: தமிழ்: ज़ूलीएँ मलर
ur: தமிழ்: ژولیئں ملاغ

source: हिंदी: Julien Malard
hi: हिंदी: ज़ूलीएँ मलर
ur: हिंदी: ژولیئں ملاغ

source: français: Julien Malard
hi: français: ज़ूलीएँ मलर
ur: français: ژولیئں ملاغ

source: Financiamiento
fa: تامین مالی
hi: वित्त पोषण
ta: நிதிகள்...
ur: شکریہ

source: Los organismos siguientes contribuyeron apoyo financiero a uno o más de los autores del código mientras trabajaban en el desarrollo de Tinamït:
fa: شرکتهایی که در زیر آورده میشود، تامین مالی یک یا چند تن از نویسندگانی که کدهای برنامه نوشته و مدل را توسعه داده اند، بر عهده داشته اند:
hi: निम्नलिखित संस्थान तीनामित के लेखक को वित्तीय सहायता दिये जब यह तीनामित का विकास पर काम कर रहे थे।
ta: இந்த நிலையங்களால் தீனாமித் எழுத்தாளர்களுக்கு நிதி கிடைத்தவிட்டது.
ur: مندرجہ ذیل اداروں نے ٹنامیٹ کی تياری پر کام کرنے والے مصنفین کو مالی امداد فراہم کی۔

source: `Conseil de recherches en sciences naturelles et en génie du Canada (CRSNG) <https://www.nserc-crsng.gc.ca>`_
fa: `دانشکده تحقیقات علوم مهندسی و طبیعی کانادا (CRSNG) <https://www.nserc-crsng.gc.ca>`_
ta: `கனடா அரசங்க இற்கை அறிவியல் மற்றும் பொறியியல் ஆராய்ச்சி சபை (CRSNG) <https://www.nserc-crsng.gc.ca>`_
ur: `قدرتی سائنس اور انجینئرنگ ریسرچ کونسل کینیڈا (سی آر ایس این جی) <https://www.nserc-crsng.gc.ca>`_

source: `Centre de recherches pour le développement international du Canada (CRDI) <https://www.idrc.ca/fr>`_
fa: مرکز تحقیقات در حال توسعه بین المللی کانادا (CRDI) <https://www.idrc.ca/fr>`_
ta: `கனடா அரசங்க சர்வதேச வளர்ச்சி ஆராய்ச்சி மையம் (CRDI) <https://www.idrc.ca/fr>`_
ur: `کینیڈا انٹرنیشنل ڈویلپمنٹ ریسرچ سینٹر (سی آر ڈی آئی, CRDI) <https://www.idrc.ca/fr>`_

source: `Fonds de recherche Nature et technologies du Québec (Canada) (FQRNT) <http://www.frqnt.gouv.qc.ca/accueil>`_
fa: صندوق تحقیقات طبیعی و تکنولوژی کبک (کانادا) (FQRNT) <http://www.frqnt.gouv.qc.ca/accueil>`_
ta: `கிபெக் அரச்ங்கம் இற்கை மற்றும் தொழில்நுட்ப ஆராய்ச்சி நிதி மையம் (கனடா) (FQRNT) <http://www.frqnt.gouv.qc.ca/accueil>`_
ur: `قدرتی تحقيق اور ٹیکنالوجی تحقيق فنڈ (کینیڈا) (FQRNT) <http://www.frqnt.gouv.qc.ca/accueil>`_

source: Instituciones afiliadas
fa: موسسات وابسته
hi: सम्बंद्ध संस्थान
ta: சேர்க்கப்பெற்ற நிலையங்கள்
ur: منسلک ادارے

source: Los autores de Tinamït están afiliados con las instituciones siguientes:
fa: همچنین نویسندگان تینامیت به موسسات زیر وابسته بودند:
hi: तीनामित के लेखक निम्नलिखत संस्थान के साथ सम्बंद्ध हैं।
ta: தீநாமித்தின் எழத்துவர்கள் இந்த நிறுவனங்களுடுன் இணைந்துள்ளன.
ur: ٹینامٹ کے تخلیق کارمندرجہ ذیل اداروں سے منسلک ہیں
