Repository: julienmalard/Tinamit
Catalog: docs/source/_local/*/LC_MESSAGES/general/intro.po
Languages: hi

source: Introducción
hi: परिचय

source: La modelización :abbr:`DS (Dinámicas de Sistemas)` es una manera popular de hacer modelos **participativos** y **visuales** para el manejo ambiental y socio-económico. `Vensim <https://vensim.com/>`_ y `Stella <https://www.iseesystems.com/store/products/stella-architect.aspx>`_ son programas populares y tienen versiones grátis.
hi: प्रणाली गतिशील के प्रतिरूप वातवरण और समाजिक-आर्थशस्त्रिक प्रबंधन के लिये **भागीदारी** और **दृश्य** प्रतिरूप बनाने का एक लोकप्रिय तरह है। `वेन्सिम <https://vensim.com/>`_ तथा `स्टेला <https://www.iseesystems.com/store/products/stella-architect.aspx>`_ दोनों लोकप्रिय प्रणाली गतिशील के उपकरण हैं जिनके मुफ्त संस्करण भी मिले जा सकते हैं।

source: No obstante, la inclusión de procesos ambientales o :abbr:`BF (biofísicos)` se complica en modelos DS. Y de verdad no deberías tener que contruir un modelo hidrológico o de cultivos en el ambiente DS solamente porque quieres ver los impactos de tu modelo socio-económico DS en el ambiente y vice-versa [1]_. Ya existen muchos modelos BF que lo hacen para ti ([2]_, [3]_, [4]_).
hi: फिर भी, प्रणाली गतिशील के प्रतिरूप में वतावरण के प्रक्रिया को शामिल करना जटिल हो जाता है। और, सच में, सिर्फ समाज के आर्थशस्त्रिक प्रभाव और आर्थशस्त्रा के समाजिक प्रभाव समझने के लिये आपको जल या फसल का प्रतिरूप प्रणाली गतिशील की भाषा में बनाने नहीं पड़ने चाहिये [1]_। इस काम के लिये पहले से ही बहुत वतावरण के प्रतिरूप बने चुके हैं ([2]_, [3]_, [4]_)।

source: ¿Pero cómo conectar un modelo DS con un BF? Por eso existe Tinamït. Empieza con nuestros tutoriales :doc:`aquí </tutorial/conex>` o, aún mejor, con la :doc:`instalción </general/instal>`.
hi: पर प्रणाली गतिशील और वतावरण के प्रतिरूप कैसा जोड़ाना। इसी के लिये हमने तीनामित बनाये। हम्हारे पाठ के साथ :doc:`यहाँ </tutorial/conex>` शुरू करना या, बहतर भी, :doc:`स्थापन </general/instal>` के साथ।

source: Figura 1
hi: आकृति १

source: Diagrama de la estructura conceptual de Tinamït.
hi: तीनामित का वैचारिक संरचना का आकृति।

source: Jeong H, Adamowski J. 2016. A system dynamics based socio-hydrological model for agricultural wastewater reuse at the watershed scaleAgricultural Water Management, 171: 89-107. https://doi.org/10.1016/j.agwat.2016.03.019
hi: Jeong H, Adamowski J. २०१६. A system dynamics based socio-hydrological model for agricultural wastewater reuse at the watershed scaleAgricultural Water Management, १७१: ८९-१०७. https://doi.org/10.1016/j.agwat.2016.03.019

source: SWAT+. https://swat.tamu.edu/software/plus/
hi: स्वाट+, https://swat.tamu.edu/software/plus/

source: SAHYSMOD. https://www.waterlog.info/sahysmod.htm
hi: साहिस्मोड, https://www.waterlog.info/sahysmod.htm

source: Jones, J.W., G. Hoogenboom, C.H. Porter, K.J. Boote, W.D. Batchelor, L.A. Hunt, P.W. Wilkens, U. Singh, A.J. Gijsman, and J.T. Ritchie. 2003. DSSAT Cropping System Model. European Journal of Agronomy 18:235-265.
hi: Jones, J.W., G. Hoogenboom, C.H. Porter, K.J. Boote, W.D. Batchelor, L.A. Hunt, P.W. Wilkens, U. Singh, A.J. Gijsman, and J.T. Ritchie. २००३. DSSAT Cropping System Model. European Journal of Agronomy १८:२३५-२६५.
