Repository: julienmalard/Tinamit
Catalog: docs/source/_local/*/LC_MESSAGES/index.po
Languages: hi

source: General
hi: सामान्य

source: Tutorial
hi: अभ्यास

source: Desarrollo
hi: विकास

source: Referencia
hi: संदर्भ

source: ¡Bienvenidoas a la documentación de Tinamït!
hi: तीनामित की प्रलेखन पर आपका स्वाहत हो।

source: Tinamït es un programa para conectar modelos socioeconómicos (dinámicas de los sistemas) con modelos biofísicos.
hi: तीनामित एक कार्यक्रम है जो समाजिक-आर्थशस्त्रिक (प्रणाली के गतिशील) और वतावरण के प्रतिरूप जोड़ा देता है।

source: Tinamït permite la conexión rápida, flexible y reproducible de modelos con:
hi: तीनामित से प्रतिरूप के संबंध तेज, लचीला औऱ प्रजनन योग्य रास्ता से होता है।

source: Una estructura fácil para conectar modelos en menos de 10 líneas (en vez de cientos).
hi: सरल संचरना जिस से क्रमानुदेशन के १० पंक्ति से कम में प्रतिरूपों जोड़ा सकते हैं।

source: Manejo automático de diferencias en escalas temporales y unidades.
hi: समय का पैमाना और एकता में मतभेद का स्वचालित प्रबंध।

source: Conexión con bases de datos para calibración y validación de modelos.
hi: प्रतिरूप के अंशांकन और पुष्टीकरण के लिये आंकड़ों के साथ जोड़ाई।

source: Inclusión automática de variables de cambios climáticos con la librería تقدیر (taqdir)
hi: تقدیر (तकदीर) नाम का पाईथोन क्रमानुदेश से जलवायु परिवर्तन के परिवर्तनशील के स्वाचलित समावेश।

source: Una estructura transparente para que todos puedan agregar modelos y recursos.
hi: पार्दशक संरचना तकि सब लोग नये प्रतिरूप और संसाधन जोड़ा सकें।

source: ¿Encontraste algún error en la documentación? Es culpa mía. Si es error de español, por favor tenga la bondad de corregirlo en `GitHub <https://github.com/julienmalard/tinamit/issues>`_. Si es en otro idioma, corrígelo :doc:`así </des/trad>`. ¡Gracias!
hi: प्रलेखन में एक गल्ती है क्या। माफ करना। अगर हिस्पानी भाषा में है, कृप्या करके उसको `GitHub <https://github.com/julienmalard/tinamit/issues>`_ पर ठीक कर देना। अगर किसी और भाषा में हो, तो :doc:`ऐसा </des/trad>` सही कर देना। आपका बहुत धन्यवाद।

source: ¿Quieres contribuir?
hi: योगदान करना चाहती हैं क्या।

source: Puedes **agregar modelos**, desarrollar **nuevas funcionalidades**, o ayudar a **traducir Tinamït** en tu lengua preferida.
hi: **नये प्रतिरूप** जोड़ा सकती हैं, **नये कार्यक्षमते** का विकास कर सकती हैं, या फिर आपकी पसंदगी भाषा में **तीनामित का अनुवाद** कर सकती हैं।

source: Contacto: Julien Malard: julien.malard@mail.mcgill.ca
hi: संपर्क: ज़ूलीएँ मलर: julien.malard@mail.mcgill.ca

source: Índice:
hi: अनुक्रमण:
